entry_record = ['이싸피', '박장고', '조실습', '이싸피', '조실습', '오디비', '임온실', '조실습', '조실습', '이싸피', '안도둑', '임온실', '최이썬', '오디비', '안도둑', '염자바', '박장고', '조실습',
                '최이썬', '조실습', '염자바', '박장고', '임온실', '임온실', '이싸피', '임온실', '오디비', '조실습', '염자바', '임온실', '박장고', '최이썬', '안도둑', '염자바', '임온실', '박장고', '이싸피', '안도둑',
                '임온실', '오디비', '최이썬', '안도둑', '이싸피', '오디비', '안도둑', '이싸피', '박장고', '박장고', '안도둑', '안도둑', '안도둑', '염자바', '최이썬', '오디비', '오디비', '최이썬', '이싸피', '임온실', '안도둑']

exit_record = ['최이썬', '조실습', '이싸피', '안도둑', '임온실', '안도둑', '이싸피', '오디비', '염자바', '박장고', '최이썬', '이싸피', '염자바', '염자바', '박장고', '임온실', '이싸피',
               '박장고', '안도둑', '염자바', '이싸피', '조실습', '조실습', '임온실', '박장고', '이싸피', '조실습', '박장고', '오디비', '안도둑', '조실습', '임온실', '안도둑', '안도둑', '임온실', '조실습', '최이썬', '안도둑', '임온실',
               '염자바', '이싸피', '임온실', '안도둑', '오디비', '안도둑', '오디비', '임온실', '염자바', '임온실', '박장고', '조실습', '이싸피', '최이썬', '최이썬', '오디비', '오디비', '염자바', '오디비', '안도둑', '박장고']

from collections import Counter

# Counter를 이용하여 횟수 세기
entry_count=Counter(entry_record)   # [{'이싸피':10, ...}]
exit_count=Counter(exit_record)


# most_common(3)이용, 가장 많이 입장한 세명 찾기
# entry_count.most_common(3)
# print(entry_count.most_common(3))

print('입장 기록이 가장 많은 사람 Top3')
for item in entry_count.most_common(3):
    print(f'{item[0]} {item[1]}회')


# Counter끼리 빼서 입장횟수와 퇴장횟수가 다른 사람 찾기 
more_entry=entry_count-exit_count
more_exit=exit_count-entry_count

print('')
print('출입 기록이 수상한 사람')
for key,value in more_entry.items():
    print(f'{key}은 입장 기록이 {value}회 더 많아 수상합니다.')
for key,value in more_exit.items():
    print(f'{key}은 퇴장 기록이 {value}회 더 많아 수상합니다.')

